Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/distutils.tmx
Source language: en
Languages: pl

source: Commands that create distributions (files in the :file:`dist/` directory) need to add ``(command, filename)`` pairs to ``self.distribution.dist_files`` so that :command:`upload` can upload it to PyPI. The *filename* in the pair contains no path information, only the name of the file itself. In dry-run mode, pairs should still be added to represent what would have been created.
pl: Polecenia które tworzą dystrybucje (pliki w katalogu :file:`dist/`) wymagają dodania par ``command, filename)`` do ``self.distribution.dist_files`` tak aby polecenie :command:`upload` mogło załadować je do PyPI. Nazwa pliku w parze nie zawiera żadnej informacji o ścieżce, tylko nazwę samego pliku. W trybie uruchomienia-na-sucho, pary powinny wciąż być dodawane aby pokazywały co mogłoby powstać.

source: Distributing Python Modules
pl: Dystrybucja modułów języka pytonowskiego

source: Authors
pl: Autorzy

source: Date
pl: Data

source: This document describes the Python Distribution Utilities ("Distutils") from the module developer's point of view, describing how to use the Distutils to make Python modules and extensions easily available to a wider audience with very little overhead for build/release/install mechanics.
pl: Ten dokument opisuje Użytki Dystrybucji języka pytonowskiego ("Distutils") z punktu widzenia twórcy modułów, opisując jak używać Distutils aby uczynić moduły i rozszerzenia języka pytonowskiego łatwo dostępne dla szerszej grupy odbiorców z bardzo niewielkim narzutem przeznaczonym na mechanikę budowy/wydania/instalacji.

source: An Introduction to Distutils
pl: Wprowadzenie do Distutils

source: This document covers using the Distutils to distribute your Python modules, concentrating on the role of developer/distributor: if you're looking for information on installing Python modules, you should refer to the :ref:`install-index` chapter.
pl: Ten dokument opisuje użycie Distutils do dystrybucji twoich modułów języka pytonowskiego koncentrując się na roli twórcy/dystrybutora: jeśli szukasz informacji o instalowaniu modułów języka pytonowskiego powinieneś odwołać się do rozdziału :ref:`install-index`.

source: Concepts & Terminology
pl: Pojęcia i Terminy

source: Using the Distutils is quite simple, both for module developers and for users/administrators installing third-party modules. As a developer, your responsibilities (apart from writing solid, well-documented and well-tested code, of course!) are:
pl: Użycie Distutils jest całkiem proste, zarówno dla twórców modułów jak i dla użytkowników/administratorów instalujących moduły ze strony osób trzecich. Jako twórca, twoim zadaniem (poza pisaniem porządnego, dobrze udokumentowanego i dobrze przetestowanego kodu, rzecz jasna!) są:

source: write a setup script (:file:`setup.py` by convention)
pl: napisanie skryptu instalacyjnego (pliku :file:`setup.py` - zgodnie ze zwyczajem)

source: (optional) write a setup configuration file
pl: (opcjonalnie) napisanie pliku konfiguracji instalacji

source: create a source distribution
pl: utworzenie dystrybucji źródłowej

source: (optional) create one or more built (binary) distributions
pl: (nadobowiązkowe) stworzyć jedną lub więcej zbudowaną (binarną) dystrybucję

source: Each of these tasks is covered in this document.
pl: Każde z tych zadań jest opisane w tym dokumencie.

source: Not all module developers have access to a multitude of platforms, so it's not always feasible to expect them to create a multitude of built distributions. It is hoped that a class of intermediaries, called *packagers*, will arise to address this need. Packagers will take source distributions released by module developers, build them on one or more platforms, and release the resulting built distributions. Thus, users on the most popular platforms will be able to install most popular Python module distributions in the most natural way for their platform, without having to run a single setup script or compile a line of code.
pl: Nie wszyscy twórcy mają dostęp do wielu maszyn/środowisk, więc nie zawsze rozsądne jest oczekiwanie od nich tworzenia wielu zbudowanych dystrybucji. Jest oczekiwane że pewien zbiór pośredników, zwanych *pakowaczami*, powstanie aby zaradzić tym potrzebom. Pakowacze biorą dystrybucje źródłowe wypuszczonych przez twórców modułów, budują je na jednej lub większej liczbie maszyn/środowisk, i wypuszczają wynikłe zbudowane dystrybucje. Zatem, użytkownicy większości popularnych platform będą w stanie instalować większość popularnych dystrybucji modułów języka pytonowskiego w najbardziej naturalny sposób dla ich maszyn/środowisk, bez konieczności uruchomienia nawet jednego skryptu instalacyjnego ani kompilowania ani jednej linijki kodu.

source: A Simple Example
pl: Prosty Przykład

source: The setup script is usually quite simple, although since it's written in Python, there are no arbitrary limits to what you can do with it, though you should be careful about putting arbitrarily expensive operations in your setup script. Unlike, say, Autoconf-style configure scripts, the setup script may be run multiple times in the course of building and installing your module distribution.
pl: Skrypt instalacyjny jest zwykle raczej prosty, chociaż od kiedy jest pisany w języku pytonowskim, nie ma odgórnych granic co można z nim zrobić, chociaż powinieneś być ostrożny w umieszczaniu dowolnie kosztownych operacji w swoim skrypcie instalacyjnym. W przeciwieństwie do dajmy na to skryptów konfiguracyjnych w stylu Autoconf-a, skrypt instalacyjny może być uruchamiany kilka razy w trakcie budowania i instalowania twojej dystrybucji modułu.

source: If all you want to do is distribute a module called :mod:`foo`, contained in a file :file:`foo.py`, then your setup script can be as simple as this::
pl: Jeśli wszystkim czego chcesz dokonać jest dystrybuowanie modułu nazwanego :mod:`foo` zawartego w pliku :file:`foo.py` wtedy twój plik skryptu instalacyjnego może być tak prosty jak::

source: Some observations:
pl: Pewne obserwacje

source: most information that you supply to the Distutils is supplied as keyword arguments to the :func:`setup` function
pl: większość informacji które dostarczasz do Distutils jest podawana jako parametry słów kluczowych do zadania :func:`setup`.

source: those keyword arguments fall into two categories: package metadata (name, version number) and information about what's in the package (a list of pure Python modules, in this case)
pl: te parametry słów kluczowych należą do dwóch kategorii: informacje o danych pakietu (- z ang. - metadata) (nazwa, numer wersji) i informacja o tym co jest w pakiecie (lista czysto pytonowskich modułów, w tym przypadku)

source: modules are specified by module name, not filename (the same will hold true for packages and extensions)
pl: moduły są określone przez nazwę modułu nie nazwę pliku (to samo odnosi się do pakietów i rozszerzeń)

source: it's recommended that you supply a little more metadata, in particular your name, email address and a URL for the project (see section :ref:`setup-script` for an example)
pl: polecane jest abyś dostarczył nieco więcej informacji o danych, w szczególności swoje imię, adres email i URL projektu (sięgnij do rozdziału :ref:`setup-script` po przykład)

source: To create a source distribution for this module, you would create a setup script, :file:`setup.py`, containing the above code, and run::
pl: Aby utworzyć dystrybucję źródłową dla tego modułu, tworzysz skrypt instalacyjny, :file:`setup.py`, zawierający powyższy kod, i uruchamiasz::

source: which will create an archive file (e.g., tarball on Unix, ZIP file on Windows) containing your setup script :file:`setup.py`, and your module :file:`foo.py`. The archive file will be named :file:`foo-1.0.tar.gz` (or :file:`.zip`), and will unpack into a directory :file:`foo-1.0`.
pl: które stworzy plik archiwum (np. plik tarball na Unix-ie, plik ZIP w Windowsie) zawierający twój skrypt instalacyjny - plik :file:`setup.py`, i twój moduł :file:`foo.py`. Archiwum będzie nazywało się :file:`foo-1.0.tar.gz` lub :file:`.zip`), i będzie odpakowywało się do katalogu :file:`foo-1.0`.

source: If an end-user wishes to install your :mod:`foo` module, all she has to do is download :file:`foo-1.0.tar.gz` (or :file:`.zip`), unpack it, and---from the :file:`foo-1.0` directory---run ::
pl: Jeśli użytkownik końcowy życzy sobie instalować twój moduł :mod:`foo`, wszystko co musi zrobić to ściągnąć plik :file:`foo-1.0.tar.gz` (lub :file:`.zip`), odpakować go, i---z katalogu :file:`foo-1.0`--- uruchomić ::

source: which will ultimately copy :file:`foo.py` to the appropriate directory for third-party modules in their Python installation.
pl: które ostatecznie kopiują plik :file:`foo.py` do odpowiedniego katalogu dla modułów pochodzących od osób trzecich w ich instalacji języka pytonowskiego.

source: This simple example demonstrates some fundamental concepts of the Distutils. First, both developers and installers have the same basic user interface, i.e. the setup script. The difference is which Distutils *commands* they use: the :command:`sdist` command is almost exclusively for module developers, while :command:`install` is more often for installers (although most developers will want to install their own code occasionally).
pl: Ten prosty przykład demonstruje pewne podstawowe pojęcia Distutils. Po pierwsze zarówno twórcy modułów jak i instalujący je mają ten sam podstawowy sprzęg użytkownika tj. skrypt instalacyjny. Różnica polega na tym, którego *polecenia* ( - z ang. - *command* ) Distutils używają: polecenie :command:`sdist` jest prawie wyłącznie dla twórców modułów, podczas gdy :command:`install` jest częściej dla instalujących (chociaż większość twórców też będzie chciała zainstalować swój własny kod czasami).

source: If you want to make things really easy for your users, you can create one or more built distributions for them. For instance, if you are running on a Windows machine, and want to make things easy for other Windows users, you can create an executable installer (the most appropriate type of built distribution for this platform) with the :command:`bdist_wininst` command. For example::
pl: Jeśli chcesz uczynić rzeczy naprawdę łatwymi dla swoich użytkowników, możesz stworzyć jedną lub więcej zbudowaną dystrybucję dla nich. Na przykład, jeśli działasz na komputerze z Windows, i chcesz uczynić rzeczy łatwymi dla innych użytkowników Windowsa, możesz utworzyć wykonywalny instalator (najbardziej odpowiedni typ zbudowanej dystrybucji dla tej maszyny/środowiska) z poleceniem :command:`bdist_wininst`. Na przykład::

source: will create an executable installer, :file:`foo-1.0.win32.exe`, in the current directory.
pl: utworzy wykonywalny instalator, :file:`foo-1.0.win32.exe`, w bierzącym katalogu.

source: Other useful built distribution formats are RPM, implemented by the :command:`bdist_rpm` command, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`), and HP-UX :program:`swinstall` (:command:`bdist_sdux`). For example, the following command will create an RPM file called :file:`foo-1.0.noarch.rpm`::
pl: Inne użyteczne formaty dystrybucji to RPMy, wypełnione przez polecenie :command:`bdist_rpm`, program :program:`pkgtootl` Solarisa (:command:`bdist_pkgtool`), i program swinstall` dla HP-UX (:command:`bdist_sdux`). Na przykład, następujące polecenie utworzy plik RPM nazwany :file:`foo-1.0.noarch.rpm`::

source: (The :command:`bdist_rpm` command uses the :command:`rpm` executable, therefore this has to be run on an RPM-based system such as Red Hat Linux, SuSE Linux, or Mandrake Linux.)
pl: (Polecenie :command:`bdist_rpm` używa polecenia wykonywalnego :command:`rpm`, zatem musi to być uruchamiane na opartym o RPMy systemie takim jak Linux Red Hat, Linux SuSE, lub Linux Mandrake.)

source: You can find out what distribution formats are available at any time by running ::
pl: Możesz dowiedzieć się o tym które formaty dystrybucji są dostępne w każdej chwili uruchamiając::

source: General Python terminology
pl: Ogólne terminy języka pytonowskiego

source: If you're reading this document, you probably have a good idea of what modules, extensions, and so forth are. Nevertheless, just to be sure that everyone is operating from a common starting point, we offer the following glossary of common Python terms:
pl: Jeśli czytasz ten dokument, pewnie masz dobre pojęcie czym są moduły, rozszerzenia, itd. itp. Tym nie mniej, aby się upewnić że wszyscy operują ze wspólnego punktu początkowego, oferujemy następujący słowniczek wspólnych terminów języka pytonowskiego:

source: the basic unit of code reusability in Python: a block of code imported by some other code. Three types of modules concern us here: pure Python modules, extension modules, and packages.
pl: podstawowa miara powtórnej użyteczności kodu w języku pytonowskim: blok kodu zaimportowany przez inny kod. Trzy typy modułów interesują nas tutaj: moduły czysto pytonowskie, moduły rozszerzające, i pakiety.

source: a module written in Python and contained in a single :file:`.py` file (and possibly associated :file:`.pyc` and/or :file:`.pyo` files). Sometimes referred to as a "pure module."
pl: moduł napisany w języku pytonowskim i zawarty w pojedynczym pliku :file:`.py` (i możliwie związany plik :file:`.pyc` i/lub plik :file:`.pyo`) Czasami określane jako "czysty moduł."

source: a module written in the low-level language of the Python implementation: C/C++ for Python, Java for Jython. Typically contained in a single dynamically loadable pre-compiled file, e.g. a shared object (:file:`.so`) file for Python extensions on Unix, a DLL (given the :file:`.pyd` extension) for Python extensions on Windows, or a Java class file for Jython extensions. (Note that currently, the Distutils only handles C/C++ extensions for Python.)
pl: moduł napisany w niskopoziomowym języku wypełnienia języka pytonowskiego: C/C++ dla języka pytonowskiego, Java dla języka Jytonowskiego. Typowo zawarty w pojedynczym dynamicznie ładowalnym uprzednio skompilowanym pliku, np. plik współdzielonych obiektów (- z ang. shared object - w skrócie so - :file:`.so`) dla rozszerzeń języka pytonowskiego dla Unix, i DLL (mając dane rozszerzenie :file:`.pyd`) dla rozszerzeń języka pytonowskiego na Windowsie, lub plik uogólnienia Javy dla języka rozszerzeń języka jytonowskiego. (Zauważ, że obecnie, Distutils obsługuje tylko rozszerzenia C/C++ dla języka pytonowskiego.)

source: a module that contains other modules; typically contained in a directory in the filesystem and distinguished from other directories by the presence of a file :file:`__init__.py`.
pl: moduł który zawiera inne moduły; typowo przechowywany w katalogu w systemie plików i rozróżniany od innych katalogów przez obecność pliku :file:`__init__.py`.

source: the root of the hierarchy of packages. (This isn't really a package, since it doesn't have an :file:`__init__.py` file. But we have to call it something.) The vast majority of the standard library is in the root package, as are many small, standalone third-party modules that don't belong to a larger module collection. Unlike regular packages, modules in the root package can be found in many directories: in fact, every directory listed in ``sys.path`` contributes modules to the root package.
pl: Korzeń hierarchii pakietów. (To nie jest właściwie pakiet, gdyż nie ma pliku :file:`__init__.py`. Ale musimy jakoś go nazwać.) Znaczna większość standardowej biblioteki jest w pakiecie korzenia, tak jak wiele małych, samodzielnych modułów osób-trzecich, które nie pasują do większej kolekcji modułów. W przeciwieństwie do typowych pakietów, moduły w pakiecie korzenia można znaleźć w wielu katalogach: w rzeczywistości, każdy katalog wypisany w ``sys.path`` dokłada moduły do pakietu korzenia.

source: Distutils-specific terminology
pl: Terminologia szczególna dla Distutils

source: The following terms apply more specifically to the domain of distributing Python modules using the Distutils:
pl: Następujące terminy odnoszą się bardziej szczególnie do domeny dystrybucji modułów pytonowskich przy użyciu Distutils:

source: a collection of Python modules distributed together as a single downloadable resource and meant to be installed *en masse*. Examples of some well-known module distributions are Numeric Python, PyXML, PIL (the Python Imaging Library), or mxBase. (This would be called a *package*, except that term is already taken in the Python context: a single module distribution may contain zero, one, or many Python packages.)
pl: kolekcja modułów języka pytonowskiego rozprowadzonych razem jako pojedynczy zasób do ściągnięcia i przeznaczony do *masowego* instalowania. Przykłady pewnych dobrze-znanych dystrybucji modułów to Numeryczny język pytonowski, PyXML, PIL (Biblioteka obrazowania w języku pytonowskim ( - z ang. - Python Imaging Library)) lub mxBase. (To byłoby nazwane *pakietem*, z wyjątkiem tego, że ten termin jest już zajęty w kontekście języka pytonowskiego: pojedyncza dystrybucja modułu może zawierać zero, jeden lub wiele pakietów.)

source: a module distribution that contains only pure Python modules and packages. Sometimes referred to as a "pure distribution."
pl: dystrybucja modułów która zawiera tylko czysto pytonowskie moduły i pakiety. Czasami określana mianem "czystej dystrybucji."

source: a module distribution that contains at least one extension module. Sometimes referred to as a "non-pure distribution."
pl: dystrybucja modułu która zawiera przynajmniej jeden moduł rozszerzeń. Czasami określana jako "nie-czysta dystrybucja."

source: the top-level directory of your source tree (or source distribution); the directory where :file:`setup.py` exists. Generally :file:`setup.py` will be run from this directory.
pl: Nadrzędnego poziomu katalog twojego drzewa źródeł (inaczej dystrybucji źródeł); katalog w którym plik :file:`setup.py` jest umieszczony. Ogólnie plik :file:`setup.py` będzie uruchomiony z tego katalogu.

source: Registering with the Package Index
pl: Rejestrowanie w indeksie pakietów ( - z ang. - Package Index)

source: The Python Package Index (PyPI) holds meta-data describing distributions packaged with distutils. The distutils command :command:`register` is used to submit your distribution's meta-data to the index. It is invoked as follows::
pl: Indeks pakietów języka pytonowskiego ( - z ang. - Python Package Index - w skr. PyPI) przechowuje opisy dystrybucji zapakowanych za pomocą distutils. Polecenie distutils :command:`register` jest używane do dostarczenia twoich danych opisujących do indeksu. Jest on wywoływany jak następuje::

source: Distutils will respond with the following prompt::
pl: Distutils odpowie następującym potwierdzeniem::

source: running register We need to know who you are, so please choose either: 1. use your existing login, 2. register as a new user, 3. have the server generate a new password for you (and email it to you), or 4. quit Your selection [default 1]:
pl: uruchamiając rejestrację musimy wiedzieć kim jesteś więc proszę wybierz: 1. zaloguj używając swojego istniejącego loginu, 2. zarejestruj jako nowy użytkownik, 3. serwer wygeneruje nowe hasło dla ciebie (i prześle je e-mailem) lub 4. wyjście Twój wybór [domyślnie 1]:

source: Note: if your username and password are saved locally, you will not see this menu.
pl: Zauważ: jeśli twoje imię i hasło są zapisywane lokalnie, nie będziesz widział tego menu.

source: If you have not registered with PyPI, then you will need to do so now. You should choose option 2, and enter your details as required. Soon after submitting your details, you will receive an email which will be used to confirm your registration.
pl: Jeśli nie zarejestrowałeś swojego modułu w PyPI będziesz potrzebował zrobić to teraz. Powinieneś wybrać opcję 2, wpisać szczegóły jak wyznaczono. Niedługo po wpisaniu szczegółów, otrzymasz email który będzie używany aby potwierdzić twoją rejestrację.

source: Once you are registered, you may choose option 1 from the menu. You will be prompted for your PyPI username and password, and :command:`register` will then submit your meta-data to the index.
pl: Gdy już jesteś zarejestrowany, możesz wybrać opcję nr. 1 z menu. Będziesz zapytany o nazwę użytkownika i hasło PyPI i polecenie :command:`register` poda twoje dane o pakiecie do indeksu.

source: You may submit any number of versions of your distribution to the index. If you alter the meta-data for a particular version, you may submit it again and the index will be updated.
pl: Możesz dostarczyć dowolną liczbę wersji swojej dystrybucji do indeksu. Jeśli zmienisz treść danych o pakiecie dla konkretnej wersji, możesz podać je jeszcze raz a indeks zostanie zmieniony.

source: PyPI holds a record for each (name, version) combination submitted. The first user to submit information for a given name is designated the Owner of that name. They may submit changes through the :command:`register` command or through the web interface. They may also designate other users as Owners or Maintainers. Maintainers may edit the package information, but not designate other Owners or Maintainers.
pl: PyPI przechowuje zapis każdej (nazwa, wersja) kombinacji przysłanej. Pierwszy użytkownik który dostarczy informację pod daną nazwą jest określany Właścicielem tej nazwy. Mogą podawać zmiany przez polecenie :command:`register` lub przez sprzęg sieciowy. Mogą także określić innych użytkowników jako Właścicieli lub osoby Utrzymujące. Osoby utrzymujące mogą zmieniać informacje o pakiecie ale nie mogą określać innych właścicieli ani osób utrzymujących.

source: By default PyPI will list all versions of a given package. To hide certain versions, the Hidden property should be set to yes. This must be edited through the web interface.
pl: Domyślnie PyPI wypisuje wszystkie wersje danego pakietu. Aby ukryć pewne wersje, Ukryta własność powinna być ustawiona na tak. To musi być zmieniane przez sprzęg sieciowy.

source: The .pypirc file
pl: plik .pypirc

source: The format of the :file:`.pypirc` file is as follows::
pl: format pliku :file:`.pypirc` jest następujący::

source: [distutils] index-servers = pypi [pypi] repository: <repository-url> username: <username> password: <password>
pl: [distutils] index-servers = pypi [pypi] repository: <adres-repozytorium> username:<nazwa_użytkownika> password: <hasło>

source: The *distutils* section defines a *index-servers* variable that lists the name of all sections describing a repository.
pl: Rozdział *distutils* definiuje zmienną *serwery-indeksu* - z ang. - *index-servers* która wypisuje nazwę wszystkich sekcji opisujących repozytorium.

source: Each section describing a repository defines three variables:
pl: Każda sekcja opisująca repozytorium określa trzy zmienne:

source: *username*, which is the registered username on the PyPI server.
pl: *nazwę-użytkownika* ( - z ang. - *username* ), która jest zarejestrowaną nazwą użytkownika na serwerze PyPI.

source: will be prompt to type it when needed.
pl: będzie zapytaniem do wpisania jej gdy zajdzie taka potrzeba.

source: If you want to define another server a new section can be created and listed in the *index-servers* variable::
pl: Jeśli chcesz określić inny serwer, nowa sekcja może być utworzona i wpisana w zmiennej *index-servers* ( z ang. - indeks serwerów ) ::

source: [distutils] index-servers = pypi other [pypi] repository: <repository-url> username: <username> password: <password> [other] repository: http://example.com/pypi username: <username> password: <password>
pl: [distutils] index-servers = pypi inne [pypi] repository: <repository-url> username: <username> password: <password> [inne] repository: http://example.com/pypi username: <username> password: <password>
